var arr = [{
        title: '微云',
        id: 1,
        pid: -1 // 虚拟的
    },
    {
        title: '我的音乐',
        id: 1234,
        pid: 1
    },
    {
        title: '我的文档',
        id: 55555,
        pid: 1
    },
    {
        title: '我的电影',
        id: 7777,
        pid: 1
    },
    {
        title: '周杰伦',
        id: 45789,
        pid: 1234
    },
    {
        title: '发如雪',
        id: 6783211122,
        pid: 45789
    },
    {
        title: '发如雪发如雪发如雪发如雪',
        id: 56676768888,
        pid: 6783211122
    },
    {
        title: '菊花台',
        id: 780432454,
        pid: 45789
    },
    {
        title: '东风破',
        id: 678964333,
        pid: 45789
    },
    {
        title: '王杰',
        id: 678900,
        pid: 1234
    },
    {
        title: '一场游戏一场梦',
        id: 689076544333,
        pid: 678900
    },
    {
        title: '我是真的爱上你',
        id: 6788999,
        pid: 678900
    },
    {
        title: '谢天笑',
        id: 5555789,
        pid: 1234
    },
    {
        title: '向阳花',
        id: 6788888,
        pid: 5555789
    },
    {
        title: '不会改变',
        id: 67888878888888,
        pid: 5555789
    },
    {
        title: 'js文档',
        id: 6666788,
        pid: 55555
    },
    {
        title: '科幻片',
        id: 6788124,
        pid: 7777
    },
    {
        title: '喜剧片',
        id: 890124680,
        pid: 7777
    }
];